In [1]:
import pandas as pd
import numpy as np

In [2]:
#read csv file
df = pd.read_csv('Rectangular Data.csv')
df

      Name        Breed  Color  Height (cm)  Weight (kg) Date of Birth
0    Sintu     Labrador  Black           57           32      7/1/2013
1    Sonam    Schnauzer  Brown           70           72     9/16/2016
2    Rattu       Poodle  White           45           25     8/25/2014
3  Dolphie    Chihuahua  Brown           18            7    12/11/2011
4    Kattu     Labrador  Black           44           23     1/20/2017
5    Pelki    Chow Chow    Tan           39           25     4/20/2015
6    Zimba  St. Bernard   Grey           55           30     2/27/2018

In [3]:
#read first five rows of the data

df.head()

      Name      Breed  Color  Height (cm)  Weight (kg) Date of Birth
0    Sintu   Labrador  Black           57           32      7/1/2013
1    Sonam  Schnauzer  Brown           70           72     9/16/2016
2    Rattu     Poodle  White           45           25     8/25/2014
3  Dolphie  Chihuahua  Brown           18            7    12/11/2011
4    Kattu   Labrador  Black           44           23     1/20/2017

In [4]:
#read last 2 rows
df.tail(2)

    Name        Breed Color  Height (cm)  Weight (kg) Date of Birth
5  Pelki    Chow Chow   Tan           39           25     4/20/2015
6  Zimba  St. Bernard  Grey           55           30     2/27/2018

In [5]:
# info() function prints information about the DataFrame such as the index dtype and column dtypes, non-null values and memory usage.

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           7 non-null      object
 1   Breed          7 non-null      object
 2   Color          7 non-null      object
 3   Height (cm)    7 non-null      int64
 4   Weight (kg)    7 non-null      int64
 5   Date of Birth  7 non-null      object
dtypes: int64(2), object(4)
memory usage: 464.0+ bytes

In [11]:
#number of rows and columns as a tuple
df.shape

(7, 6)

In [7]:
#Basic Statistical details
df.describe()

       Height (cm)  Weight (kg)
count     7.000000     7.000000
mean     46.857143    30.571429
std      16.385243    19.973792
min      18.000000     7.000000
25%      41.500000    24.000000
50%      45.000000    25.000000
75%      56.000000    31.000000
max      70.000000    72.000000

In [8]:
#to show only the values in the DataFrame 
df.values

array([['Sintu', 'Labrador', 'Black', 57, 32, '7/1/2013'],
       ['Sonam', 'Schnauzer', 'Brown', 70, 72, '9/16/2016'],
       ['Rattu', 'Poodle', 'White', 45, 25, '8/25/2014'],
       ['Dolphie', 'Chihuahua', 'Brown', 18, 7, '12/11/2011'],
       ['Kattu', 'Labrador', 'Black', 44, 23, '1/20/2017'],
       ['Pelki', 'Chow Chow', 'Tan', 39, 25, '4/20/2015'],
       ['Zimba', 'St. Bernard', 'Grey', 55, 30, '2/27/2018']],
      dtype=object)

In [9]:
#to return the column labels
df.columns

Index(['Name', 'Breed', 'Color', 'Height (cm)', 'Weight (kg)',
       'Date of Birth'],
      dtype='object')

In [10]:
df.index

RangeIndex(start=0, stop=7, step=1)